Catalogs/Заметки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Заметки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Темы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойТекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тэг</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Тэги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Картинка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗаметкиФайлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ширина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Высота</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Примечания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Текстовка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыПримечаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>id</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ВидыСписковHTML.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыСписковHTML</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Маркированный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нумерованный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Определений</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыПримечаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыПримечаний</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Комментарий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Описание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Определение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фрагмент</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ЗаметкиФайлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЗаметкиФайлы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВладелецФайла</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Заметки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Base64Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Тэги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Тэги</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Одиночный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Заметки/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОписаниеМетодов
// `ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)` - инициализирует структуру HTML: при пустом составе добавляет начальную разметку, формирует `Объект.ОсновнойТекст` и загружает состав в таблицу формы.
// `ПриОткрытии(Отказ)` - на клиенте задает видимость элементов (режим редактирования/просмотра) и подготавливает переменные для работы с формой.
// `ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)` - по результату выбора формирует структуру вставки (файл/картинка или обычный текст), добавляет строку в состав и обновляет основной HTML.
// `РедактироватьПриИзменении(Элемент)` - переключает UI между режимами редактирования/просмотра и обновляет видимость элементов.
// `ТекстСтрокиОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)` - завершает ввод текста в редактируемой строке, подготавливая обновленный HTML для строки.
// `ТемаПриИзменении(Элемент)` - триггерит серверное обновление (в текущем варианте серверная логика пустая).
// `ОсновнойТекстПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)` - обработчик кликов по HTML: управляет предпросмотром, открывает описания по якорям и обрабатывает навигационные ссылки.
// `ПоляПриАктивизацииСтроки(Элемент)` - при активации строки заполняет поле HTML для редактирования; для картинок формирует `img` с `base64`.
// `ПоляШиринаПриИзменении(Элемент)` - синхронизирует атрибут `width` в HTML строки.
// `ПоляВысотаПриИзменении(Элемент)` - синхронизирует атрибут `height` в HTML строки.
// `КомандаВвестиТекст(Команда)` - включает режим ввода новой строки текста.
// `КомандаДобавитьТекст(Команда)` - добавляет новую строку в `Объект.Состав` по введенному тексту, обновляет `Объект.ОсновнойТекст` и сбрасывает состояние редактирования.
// `КомандаЗагрузитьКартинку(Команда)` - открывает диалог помещения файла/картинки и регистрирует обработчик после выбора.
// `КомандаДобавитьКартинку(Команда)` - открывает форму выбора файла/картинки из справочника `ЗаметкиФайлы` с отбором владельца.
// `КомандаСохранить(Команда)` - открывает диалог сохранения файла на диск (если в текущей строке есть картинка/файл).
// `КомандаЖирный(Команда)` - применяет форматирование `b` к выделенному фрагменту.
// `КомандаКурсив(Команда)` - применяет форматирование `i` к выделенному фрагменту.
// `КомандаПодчеркнутый(Команда)` - применяет форматирование `u` к выделенному фрагменту.
// `КомандаЗачеркнутый(Команда)` - применяет форматирование `s` к выделенному фрагменту.
// `КомандаMark(Команда)` - применяет выделение `mark` к выделенному фрагменту.
// `КомандаЗнакМеньше(Команда)` - вставляет в выделение HTML-сущность `&lt;` с учетом позиции вставки.
// `КомандаЗнакБольше(Команда)` - вставляет в выделение HTML-сущность `&gt;` с учетом позиции вставки.
// `КомандаВставкаСсылки(Команда)` - открывает форму ввода ссылки и подготавливает параметры для вставки `href`.
// `КомандаЗакрытьПредпросмотр(Команда)` - скрывает блок предпросмотра.
// `КомандаОписание(Команда)` - открывает форму добавления описания для выделенного текста и рассчитывает позицию вставки якорной ссылки.
// `КомандаH1(Команда)` - включает режим редактирования и задает тег заголовка `H1`.
// `КомандаH2(Команда)` - включает режим редактирования и задает тег заголовка `H2`.
// `КомандаH3(Команда)` - включает режим редактирования и задает тег заголовка `H3`.
// `КомандаH4(Команда)` - включает режим редактирования и задает тег заголовка `H4`.
// `КомандаH5(Команда)` - включает режим редактирования и задает тег заголовка `H5`.
// `КомандаH6(Команда)` - включает режим редактирования и задает тег заголовка `H6`.
// `КомандаСписки(Команда)` - открывает форму ввода списка HTML и вызывает обработчик после ввода.
// `КомандаТаблица(Команда)` - открывает форму ввода таблицы HTML и вызывает обработчик после ввода.
// `ПослеЗакрытияДиалогаВыбора (ОписаниеФайла, ДопПараметры) Экспорт` - после выбора файла помещает его в хранилище, готовит параметры вставки (img/file) и добавляет строку в состав.
// `СохранитьФайлВХранилище(Структура)` - создает элемент справочника `ЗаметкиФайлы`, сохраняет двоичные данные в хранилище и возвращает ссылку на созданный объект.
// `ПолучитьТэгКартинки(Расширение)` - по расширению определяет, какой тег вставки использовать (`img` для картинок, `file` для остальных).
// `ЭтоКартинка(Расширение)` - проверяет, относится ли расширение к списку поддерживаемых графических форматов.
// `СформироватьСтруктуруДляВставкиФайла(СсылкаФайл)` - формирует структуру параметров вставки файла/картинки (номер строки, тег, ссылка на файл).
// `Base64ДанныеСервер(Картинка)` - возвращает base64-данные из реквизита `Картинка`.
// `ПослеВыбораКаталогаСохраненияФайла(КаталогВыбор, Диалог) Экспорт` - после выбора каталога сохраняет выбранный файл и выводит уведомление об успехе/ошибке.
// `СсылкаНаДвоичныеДанныеФайла(Картинка)` - возвращает ссылку на двоичные данные файла из хранилища.
// `ПолучитьСведенияОФайле(Картинка)` - возвращает структуру с именем и расширением файла.
// `ИзменитьТекстСтрокиHTML(ТекстВставки, ЭтоКартинка)` - обновляет HTML строки в форме: для картинок подставляет маркер, для текста нормализует переносы строк и оборачивает в mini-HTML.
// `ИзменитьВыделенное(Структура)` - модифицирует выделенный текст по параметрам (одиночный тег, двойной тег, спецсимвол, либо ссылка).
// `ТекстДляВставкиСпецсимвола(Структура)` - формирует значение для вставки спецсимвола до/после выделенного текста.
// `ТекстДляВставкиОдиночногоСимвола(Структура)` - оборачивает выделенный текст в одиночный тег либо подставляет спецсимвол.
// `ТекстДляВставкиДвойногоСимвола(Структура)` - формирует HTML с парными тегами; для `href` создает ссылку `<a ...>`.
// `ДобавитьНачальнуюСтраницуHTML()` - добавляет начальную структуру HTML-документа в `Объект.Состав`.
// `ДобавитьHead()` - формирует секцию `<head>` (meta charset + title).
// `СформироватьСтруктуруДляВставки(ВыбранноеЗначение)` - создает структуру для вставки обычного текста (номер строки, тег, значение).
// `ПослеФормыВводаСписка(Параметр, ДопПараметры) Экспорт` - после ввода списка добавляет строку с HTML-списком (`ul`/`ol`).
// `ПослеФормаВводаТаблицы(Параметр, ДопПараметры) Экспорт` - обработчик после ввода таблицы (в текущем коде пустая).
// `УстановитьВидимость(Структура)` - переключает видимость групп элементов формы по флагам `Редактируется`/`НовыйТекст`.
// `ПослеВыбораСсылки(Параметр, ДопПараметры) Экспорт` - применяет вставку ссылки (`href`) на выделенный фрагмент.
// `ПослеВыбораОписания(Параметр, ДопПараметры) Экспорт` - добавляет запись описания в `Объект.Примечания` и вставляет якорную ссылку `(о)` в текущую строку.
// `НайтиНомерОписания(ID)` - ищет номер/последний индекс описания по `id` в `Объект.Примечания`.
// `ДобавитьСтрокуHTML(Структура)` - вставляет/добавляет строку в `Объект.Состав` и синхронизирует таблицу формы.
// `ДобавитьСписокHTML(Структура)` - генерирует HTML списка (`ul`/`ol`) из массива строк и добавляет его в состав.
// `СформироватьОсновнойТекст()` - собирает итоговый HTML по строкам `Объект.Состав` через `ОсновнойТекстHTMLСервер`.
// `ВставкаДляСтрокиТекста(ТекстВставки)` - формирует mini-страницу HTML для редактирования одной строки.
// `СформироватьСтруктуруФорматированияТекста()` - возвращает структуру настроек форматирования (флаги одиночности/спецсимвола/позиции).
// `ОдиночныйТэг(Тэг)` - возвращает признак `Одиночный` у тега.
// `ПолучитьНомерСтрокиДляВставки()` - определяет номер строки, куда вставлять новый фрагмент (по позиции `</body>`).
// `ПолучитьКоличествоСтрокПолей()` - возвращает количество строк в табличной части `Объект.Состав`.
// `ТемаПриИзмененииНаСервере()` - серверная реакция на изменение темы (сейчас логика не заполнена).
// `ПолучитьОписаниеИзСтроки(СтрокаОписания)` - извлекает `id` из ссылки вида `#...` и возвращает текст описания из `Объект.Примечания`.
// `ДобавитьСтрокуТаблицы(Структура)` - добавляет строку в таблицу формы `мТаблицаСостав`, синхронизируя тег/значение.
// `УдалитьСоставВТаблицу()` - выгружает `Объект.Состав` в табличное значение для формирования HTML.
// `СоставВТаблицу()` - загружает значение реквизита `мТаблицаСостав` обратно в `Объект.Состав`.
// `ТаблицуВСостав(Таблица)` - загружает табличное значение из `мТаблицаСостав` обратно в `Объект.Состав`.

#КонецОбласти

#Область ОбработчикиСобытийФормы

//Основная процедура,
//Добавляет начальную (пустую) страницу или формирует имеющие в ТЧ Поля
//
&НаСервере
// Описание: инициализация HTML для формы при создании (если состав пустой, добавляет начальную страницу; затем формирует ОсновнойТекст и загружает состав в таблицу).
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	 
	Если ПолучитьКоличествоСтрокПолей() = 0 Тогда
 		ДобавитьНачальнуюСтраницуHTML();	
	КонецЕсли;
	
	Объект.ОсновнойТекст = СформироватьОсновнойТекст(); 	
	
	//ЗакладкаКонца = ФормДокумен.ПолучитьЗакладкуКонца();
	СоставВТаблицу();
КонецПроцедуры

//Основная процедура,
//Настраиваем видимость элементов на форме
//
&НаКлиенте
// Описание: настройка видимости элементов формы при открытии (режим редактирования/просмотра).
Процедура ПриОткрытии(Отказ)
	Структура = Новый Структура("Редактируется, Новыйтекст", Ложь, Ложь);
	УстановитьВидимость(Структура);
	
	//NameID 		= ДанныеСобытия.Element.innerText;
	//		//Сообщить(NameID);
	//		ТекID 		= Элементы.ОсновнойТекст.Документ.getElementById(NameID);
	//		ТекПозиция 	= ТекID.offsetTop;
	//		Элементы.ОсновнойТекст.Документ.body.scrollTop = ТекПозиция;   
	
	document 	= Элементы.ОсновнойТекст.Документ;
	curPos 		= document.scrollTop(); 
	
	//height		= document.body.height();
	
    //curPos=$(document).scrollTop();
	//height=$("body").height();
	//scrollTime=(height-curPos)/1.73
	
	
	ЭтоЗаголовок 		= Неопределено;
КонецПроцедуры

//Срабатывает при выборе из другого объекта, картинки 
//
&НаКлиенте
// Описание: обработчик выбора элемента (формирует структуру для вставки в HTML: файл/картинка или обычный текст), добавляет строку в состав и обновляет ОсновнойТекст.
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)	
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ЗаметкиФайлы") Тогда
		Структура = СформироватьСтруктуруДляВставкиФайла(ВыбранноеЗначение);
	Иначе
		Структура = СформироватьСтруктуруДляВставки(ВыбранноеЗначение);
	КонецЕсли;	
	
 	ДобавитьСтрокуHTML(Структура); 
	
	Объект.ОсновнойТекст 	= СформироватьОсновнойТекст();	
	
	Модифицированность 		= Истина;

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

//Когда редактирование закончено, 
//изменяем видимость элементов на форме
//обновляем основной HTML
//
&НаКлиенте
// Описание: переключает UI в режим редактирования/просмотра и обновляет видимость групп элементов.
Процедура РедактироватьПриИзменении(Элемент)
	Структура = Новый Структура("Редактируется, Новыйтекст", Редактировать, Ложь);
	УстановитьВидимость(Структура);		
КонецПроцедуры

//Когда редактирование закончено,
//меняем текст конкретной, редактируемой строки
//
&НаКлиенте
// Описание: завершение ввода текста строки (пересобирает HTML-значение строки в ТЧ).
Процедура ТекстСтрокиОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ИзменитьТекстСтрокиHTML(Текст, Ложь);
КонецПроцедуры

&НаКлиенте
// Описание: инициирует серверную обработку изменения темы (в текущем модуле серверный обработчик пустой).
Процедура ТемаПриИзменении(Элемент)
	ТемаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
// Описание: обработка клика по HTML в ОсновнойТекст (управляет предпросмотром и открывает/перенаправляет по ссылкам и якорям описаний).
Процедура ОсновнойТекстПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	 СтандартнаяОбработка = Ложь;
	 
	 Если ЗначениеЗаполнено(ДанныеСобытия.Href) Тогда    
		 Если Элементы.ПредпросмотрHTML.Видимость 	= Истина Тогда 
			 Элементы.ПредпросмотрHTML.Видимость 	= Ложь;
		 Иначе	
			 Элементы.ПредпросмотрHTML.Видимость 	= Истина;
		 КонецЕсли; 
		 
		 ЧтоИскать = "#Описание";  
		 
		 Если СтрНайти(ДанныеСобытия.Href, ЧтоИскать)>0 Тогда  
			ТекстВставки 		= ПолучитьОписаниеИзСтроки(ДанныеСобытия.Element.href);
			ПредпросмотрHTML 	= ВставкаДляСтрокиТекста(ТекстВставки);
		 ИначеЕсли Лев(ДанныеСобытия.Href, 3) = "e1c" Тогда 
			Элементы.ПредпросмотрHTML.Видимость 	= Ложь;
			ПерейтиПоНавигационнойСсылке(ДанныеСобытия.Href); 
		 Иначе
			ПредпросмотрHTML 	= ДанныеСобытия.Href;
		 КонецЕсли;
	 КонецЕсли;

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСостав

//Заполняем поле ТекстСтрокиHTML
//
&НаКлиенте
// Описание: подготавливает поле редактирования строки (если строка с картинкой - формирует img на base64 с учетом ширины/высоты).
Процедура ПоляПриАктивизацииСтроки(Элемент)
	ТекСтрока 	= Элемент.ТекущиеДанные;
	ТекстСтроки = ТекСтрока.Значение;
	ЭтоКартинка = Ложь;
	Если ЗначениеЗаполнено(ТекСтрока.Картинка) Тогда
		Ширина = ?(ТекСтрока.Ширина = 0, 500,ТекСтрока.Ширина);
		Высота = ?(ТекСтрока.Высота = 0, 300,ТекСтрока.Высота); 
		СтрокаВставкиРазмера 	= "' width='"+Ширина+"' height='"+Высота+"'>";
		ТекстДляВставки = "<img src='data:image/;base64," + Base64ДанныеСервер(ТекСтрока.Картинка)+СтрокаВставкиРазмера;
		ЭтоКартинка 	= Истина;
	Иначе
		ТекстДляВставки = Элемент.ТекущиеДанные.Значение;	
	КонецЕсли;
	
	ИзменитьТекстСтрокиHTML(ТекстДляВставки, ЭтоКартинка);
КонецПроцедуры

//Изменяем поле ТекстСтрокиHTML для картинки
//
&НаКлиенте
// Описание: обновляет атрибут width в HTML для редактируемой картинки.
Процедура ПоляШиринаПриИзменении(Элемент)
	ПоискШирина = СтрНайти(ТекстСтрокиHTML,"width");
	ПоискВысота = СтрНайти(ТекстСтрокиHTML,"height");
	Разница 	= ПоискВысота - ПоискШирина;
	Если ПоискШирина > 0 Тогда 
		СтрокаДляЗамены = Сред(ТекстСтрокиHTML, ПоискШирина, Разница-1);
		СтрокаЗамены 	= "width='"+Элементы.Состав.ТекущиеДанные.Ширина+"'";
	КонецЕсли;	
	ТекстСтрокиHTML = СтрЗаменить(ТекстСтрокиHTML, СтрокаДляЗамены, СтрокаЗамены); 
КонецПроцедуры

//Изменяем поле ТекстСтрокиHTML для картинки
//
&НаКлиенте
// Описание: обновляет атрибут height в HTML для редактируемой картинки.
Процедура ПоляВысотаПриИзменении(Элемент)
	ПоискВысота = СтрНайти(ТекстСтрокиHTML,"height");
	ПоискСтиль 	= СтрНайти(ТекстСтрокиHTML,"style");
	Разница 	= ПоискСтиль - ПоискВысота;

	Если ПоискВысота > 0 Тогда
		СтрокаДляЗамены = Сред(ТекстСтрокиHTML, ПоискВысота, Разница-1);
		СтрокаЗамены 	= "height='"+Элементы.Состав.ТекущиеДанные.Высота+"'";
	КонецЕсли;
	ТекстСтрокиHTML = СтрЗаменить(ТекстСтрокиHTML, СтрокаДляЗамены, СтрокаЗамены); 
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

//Открывает окно для ввода текста
//
&НаКлиенте
// Описание: переводит форму в режим ввода новой текстовой строки (показывает блок редактирования).
Процедура КомандаВвестиТекст(Команда)
	Структура = Новый Структура("Редактируется, Новыйтекст", Не Элементы.ГруппаРедактирования.видимость, Истина);
	УстановитьВидимость(Структура);	
	ЭтоЗаголовок 		= Неопределено;
КонецПроцедуры

&НаКлиенте
// Описание: добавляет новую строку в состав по введенному тексту (с учетом режима редактирования), обновляет ОсновнойТекст и сбрасывает флаги редактирования.
Процедура КомандаДобавитьТекст(Команда)
	
	Если ЗначениеЗаполнено(ТекстСтроки) Тогда
		Структура = Новый Структура;
		Если Редактировать Тогда
			НомерТекущейСтроки = Элементы.Состав.ТекущиеДанные.НомерСтроки; 		
		КонецЕсли;
		Структура.Вставить("НомерСтроки"	, НомерТекущейСтроки);
		
		ДобавитьСтрокуТаблицы(Структура);

		Объект.ОсновнойТекст = СформироватьОсновнойТекст();
		
		Структура = Новый Структура("Редактируется, Новыйтекст", Ложь, Истина);
		УстановитьВидимость(Структура);

		Редактировать		= Ложь;	
		Модифицированность 	= Истина;
		
	КонецЕсли;
	
КонецПроцедуры

//Открывает диалог загрузки новой картинки/файла
//
&НаКлиенте
// Описание: открывает диалог выбора файла/картинки и регистрирует обработчик после закрытия диалога.
Процедура КомандаЗагрузитьКартинку(Команда)
	Диалог = новый ПараметрыДиалогаПомещенияФайлов("Выберите файл картинки", Ложь,);
		
	Оповещение = новый ОписаниеОповещения("ПослеЗакрытияДиалогаВыбора", ЭтотОбъект);
	
	НачатьПомещениеФайлаНаСервер(Оповещение,,,, Диалог, УникальныйИдентификатор);
	
КонецПроцедуры

//Выбирает картинку/файл из справочника
//
&НаКлиенте
// Описание: открывает форму выбора картинки/файла из справочника ЗаметкиФайлы с отбором по текущему владельцу.
Процедура КомандаДобавитьКартинку(Команда)
	ЗначениеОтбора = Новый Структура("ВладелецФайла", Объект.Ссылка);
	ПараметрыФормы = Новый Структура("Отбор"		, ЗначениеОтбора);
	
	ОткрытьФорму("Справочник.ЗаметкиФайлы.Форма.ФормаВыбора", ПараметрыФормы, ЭтотОбъект);
КонецПроцедуры

//Сохраняет картинку в файл
//
&НаКлиенте
// Описание: сохраняет файл/картинку из текущей строки в указанную пользователем папку (через диалог сохранения).
Процедура КомандаСохранить(Команда)
	
	Если ЗначениеЗаполнено(Элементы.Состав.текущиеДанные.Картинка) Тогда
		Расширение = "jpg";
		ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
		ДиалогОткрытияФайла.ПолноеИмяФайла 	= Объект.Наименование;
		ДиалогОткрытияФайла.Расширение 		= Расширение;
		ДиалогОткрытияФайла.Заголовок 		= "Укажите каталог для сохранения файла";

		Оповещение = Новый ОписаниеОповещения("ПослеВыбораКаталогаСохраненияФайла", ЭтотОбъект, ДиалогОткрытияФайла);

		ДиалогОткрытияФайла.Показать(Оповещение);
	КонецЕсли;
	
КонецПроцедуры

#Область ФорматированияТекста
//Изменяет выделенный текст на жирный
//
&НаКлиенте
// Описание: применяет к выделенному фрагменту форматирование жирным (HTML-тег b).
Процедура КомандаЖирный(Команда)
    Структура = СформироватьСтруктуруФорматированияТекста();
    Структура.Вставить("Символ", "b");
    
	ИзменитьВыделенное(Структура);
КонецПроцедуры

//Изменяет выделенный текст на курсив
//
&НаКлиенте
// Описание: применяет к выделенному фрагменту форматирование курсивом (HTML-тег i).
Процедура КомандаКурсив(Команда)
	Структура = СформироватьСтруктуруФорматированияТекста();
	Структура.Вставить("Символ", "i");
	
	ИзменитьВыделенное(Структура);
КонецПроцедуры

//Изменяет выделенный текст на поддчеркнутый
//
&НаКлиенте
// Описание: применяет к выделенному фрагменту подчеркнутый текст (HTML-тег u).
Процедура КомандаПодчеркнутый(Команда) 
	Структура = СформироватьСтруктуруФорматированияТекста();
	Структура.Вставить("Символ", "u");
	
	ИзменитьВыделенное(Структура);
КонецПроцедуры

//Изменяет выделенный текст на зачеркнутый
//
&НаКлиенте
// Описание: применяет к выделенному фрагменту зачеркивание (HTML-тег s).
Процедура КомандаЗачеркнутый(Команда)
	Структура = СформироватьСтруктуруФорматированияТекста();
	Структура.Вставить("Символ", "s");
	
	ИзменитьВыделенное(Структура);
КонецПроцедуры

&НаКлиенте
// Описание: применяет к выделенному фрагменту форматирование выделения (HTML-тег mark).
Процедура КомандаMark(Команда)
	Структура = СформироватьСтруктуруФорматированияТекста();
	Структура.Вставить("Символ", "mark");
	
	ИзменитьВыделенное(Структура);
КонецПроцедуры

//Добавляет к выделенному тексту <
//
&НаКлиенте
// Описание: вставляет в выделение HTML-сущность &lt; с учетом позиции (до/после выделенного фрагмента).
Процедура КомандаЗнакМеньше(Команда) 	
	Структура = Новый Структура;
	Структура.Вставить("Символ"			, "&lt; ");
	Структура.Вставить("Одиночный"		, Истина);
	Структура.Вставить("Спесимвол"		, Истина);
	Структура.Вставить("МестоВставки"	, "Перед");
	Структура.Вставить("Заголовок"		, Ложь);
	ИзменитьВыделенное(Структура);
КонецПроцедуры

//Добавляет к выделенному тексту >
//
&НаКлиенте
// Описание: вставляет в выделение HTML-сущность &gt; с учетом позиции (до/после выделенного фрагмента).
Процедура КомандаЗнакБольше(Команда)
	Структура = Новый Структура;
	Структура.Вставить("Символ"			, " &gt;");
	Структура.Вставить("Одиночный"		, Истина);
	Структура.Вставить("Спесимвол"		, Истина);
	Структура.Вставить("МестоВставки"	, "После");
	Структура.Вставить("Заголовок"		, Ложь);
	ИзменитьВыделенное(Структура);
КонецПроцедуры

#КонецОбласти

&НаКлиенте
// Описание: открывает форму ввода ссылки и после выбора применяет вставку на основе выделенного текста.
Процедура КомандаВставкаСсылки(Команда)
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораСсылки", ЭтотОбъект);
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ВыделенныйТекс", Элементы.ТекстСтроки.ВыделенныйТекст);
	ОткрытьФорму("Справочник.Заметки.Форма.ФормаВводаСсылки", ПараметрыОткрытия, , Новый УникальныйИдентификатор(),,,Оповещение);
КонецПроцедуры

&НаКлиенте
// Описание: скрывает блок предпросмотра HTML.
Процедура КомандаЗакрытьПредпросмотр(Команда)
	Элементы.ГруппаПредпросмотр.Видимость 	= Ложь;
КонецПроцедуры

&НаКлиенте
// Описание: открывает форму добавления описания к выделенному фрагменту и рассчитывает якорную ссылку (о).
Процедура КомандаОписание(Команда) 
	
	мВыделенныйТекст = Элементы.ТекстСтроки.ВыделенныйТекст;	
	Если Не мВыделенныйТекст = "" Тогда
		НомерВставки = СтрНайти(Элементы.Состав.ТекущиеДанные.Значение, мВыделенныйТекст);
		НомерВставки = НомерВставки + СтрДлина(мВыделенныйТекст) + 1; 

		ПараметрыВставки = Новый Структура();
		ПараметрыВставки.Вставить("ТекСтрока"		, Элементы.Состав.ТекущаяСтрока);  
		ПараметрыВставки.Вставить("Выделенныйтекст"	, мВыделенныйТекст);
		ПараметрыВставки.Вставить("НомерВставки"	, НомерВставки);
		
		Оповещение = Новый ОписаниеОповещения("ПослеВыбораОписания", ЭтотОбъект, ПараметрыВставки);
		ОткрытьФорму("Справочник.Заметки.Форма.ФормаОписания", ПараметрыВставки, , Новый УникальныйИдентификатор(),,,Оповещение);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Описание: включает редактирование и задает заголовок уровня H1 (через предопределенный тег).
Процедура КомандаH1(Команда)
	Структура = Новый Структура("Редактируется, Новыйтекст", Истина, Истина);
	УстановитьВидимость(Структура);	
	ЭтоЗаголовок = ПредопределенноеЗначение("Справочник.Тэги.H1");
КонецПроцедуры

&НаКлиенте
// Описание: включает редактирование и задает заголовок уровня H2 (через предопределенный тег).
Процедура КомандаH2(Команда)
	Структура = Новый Структура("Редактируется, Новыйтекст", Истина, Истина);
	УстановитьВидимость(Структура);	
	ЭтоЗаголовок = ПредопределенноеЗначение("Справочник.Тэги.H2");
КонецПроцедуры

&НаКлиенте
// Описание: включает редактирование и задает заголовок уровня H3 (через предопределенный тег).
Процедура КомандаH3(Команда)
	Структура = Новый Структура("Редактируется, Новыйтекст", Истина, Истина);
	УстановитьВидимость(Структура);	
	ЭтоЗаголовок = ПредопределенноеЗначение("Справочник.Тэги.H3");	
КонецПроцедуры

&НаКлиенте
// Описание: включает редактирование и задает заголовок уровня H4 (через предопределенный тег).
Процедура КомандаH4(Команда)
	Структура = Новый Структура("Редактируется, Новыйтекст", Истина, Истина);
	УстановитьВидимость(Структура);	
	ЭтоЗаголовок = ПредопределенноеЗначение("Справочник.Тэги.H4");
КонецПроцедуры

&НаКлиенте
// Описание: включает редактирование и задает заголовок уровня H5 (через предопределенный тег).
Процедура КомандаH5(Команда)
	Структура = Новый Структура("Редактируется, Новыйтекст", Истина, Истина);
	УстановитьВидимость(Структура);	
	ЭтоЗаголовок = ПредопределенноеЗначение("Справочник.Тэги.H5");
КонецПроцедуры

&НаКлиенте
// Описание: включает редактирование и задает заголовок уровня H6 (через предопределенный тег).
Процедура КомандаH6(Команда)
	Структура = Новый Структура("Редактируется, Новыйтекст", Истина, Истина);
	УстановитьВидимость(Структура);	
	ЭтоЗаголовок = ПредопределенноеЗначение("Справочник.Тэги.H6");
КонецПроцедуры

&НаКлиенте
// Описание: открывает диалог ввода списка HTML (маркированный/нумерованный) и подписывает обработчик после ввода.
Процедура КомандаСписки(Команда)
	Оповещение = Новый ОписаниеОповещения("ПослеФормыВводаСписка", ЭтотОбъект,);
	ОткрытьФорму("Справочник.Заметки.Форма.ФормаВводаСписка",,,,,,Оповещение);
КонецПроцедуры

&НаКлиенте
// Описание: открывает диалог ввода таблицы HTML и подписывает обработчик после ввода.
Процедура КомандаТаблица(Команда)
	Оповещение = Новый ОписаниеОповещения("ПослеФормаВводаТаблицы", ЭтотОбъект,);
	ОткрытьФорму("Справочник.Заметки.Форма.ФормаВводаТаблицы",,,,,,Оповещение);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область КартинкаФайл
//Обработка выбора картинки/файла
//
&НаКлиенте
// Описание: после выбора файла сохраняет его в хранилище (создает элемент справочника), формирует параметры вставки (img/file) и добавляет соответствующую строку в состав.
Процедура ПослеЗакрытияДиалогаВыбора (ОписаниеФайла, ДопПараметры) Экспорт
	
	Если ОписаниеФайла = Неопределено Тогда
		Возврат;
	КОнецЕсли;
	
	СсылкаНаОбъект 	= Объект.Ссылка;
	Расширение 		= ОписаниеФайла.СсылкаНаФайл.Расширение;
	Структура 		= Новый Структура();
	Структура.Вставить("Адрес", 		ОписаниеФайла.Адрес);
	Структура.Вставить("Владелец", 		СсылкаНаОбъект);
	Структура.Вставить("Имя", 			ОписаниеФайла.СсылкаНаФайл.Файл.ИмяБезРасширения);
	Структура.Вставить("Расширение", 	Расширение);	
	 
	СсылкаФайл	= СохранитьФайлВХранилище(Структура);
	НомерСтроки = ПолучитьНомерСтрокиДляВставки();
	
	Структура = Новый Структура;
 	Структура.Вставить("ТекстДобавления", ОписаниеФайла.СсылкаНаФайл.Имя);
 	Структура.Вставить("НомерСтроки"	, НомерСтроки-1);
 	Структура.Вставить("Вставка"		, Истина);
 	Структура.Вставить("Тэг"			, ПолучитьТэгКартинки(Расширение));
 	Структура.Вставить("Картинка"		, СсылкаФайл);
 	
 	 ДобавитьСтрокуHTML(Структура); 
	
	Объект.ОсновнойТекст 	= СформироватьОсновнойТекст();	
	
	Модифицированность 		= Истина;

КонецПроцедуры

//Создает новый элеменет справочника ЗаметкиФайлы
//
&НаСервере
Функция СохранитьФайлВХранилище(Структура)
	
	НовФайл = Справочники.ЗаметкиФайлы.СоздатьЭлемент();
	НовФайл.ВладелецФайла 		= Структура.Владелец;
	НовФайл.Наименование 		= Структура.Имя;
	НовФайл.Расширение			= Структура.Расширение;
	НовФайл.ДатаСоздания 		= ТекущаяДатаСеанса();
	НовФайл.ФайлХранилище 		= Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Структура.Адрес));
	
	НовФайл.Записать();
	
	Возврат НовФайл.Ссылка;
КонецФункции

//Определяем по расширнею картинка (img) это или файл (File)
//
&НаСервере
Функция ПолучитьТэгКартинки(Расширение)	
	
	Если ЭтоКартинка(Расширение) Тогда
		ТэгКартинки = Справочники.Тэги.img;
	Иначе
		ТэгКартинки = Справочники.Тэги.File;
	КонецЕсли;	
		
	Возврат ТэгКартинки;	
	
КонецФункции

//Определим картинку из списка расширений
//
&НаСервере
Функция ЭтоКартинка(Расширение)
	
	ЭтоКартинка = Ложь;
	
	Если Расширение = ".jpeg" 
		Или Расширение = ".jpg"
		Или Расширение = ".gif"
		Или Расширение = ".bmp"
		Или Расширение = ".svg"
		Или Расширение = ".png" Тогда
		
		ЭтоКартинка = Истина;	
	КонецЕсли;
			
	Возврат ЭтоКартинка;		
КонецФункции

//Добавляем данные по файлу в структуру - унификация 
//
&НаСервере
Функция СформироватьСтруктуруДляВставкиФайла(СсылкаФайл)
	НомерСтроки = ПолучитьНомерСтрокиДляВставки();
	
	Структура = Новый Структура();	
 	Структура.Вставить("ТекстДобавления", СсылкаФайл.Наименование);
 	Структура.Вставить("НомерСтроки"	, НомерСтроки-1);
 	Структура.Вставить("Вставка"		, Истина);
 	Структура.Вставить("Тэг"			, ПолучитьТэгКартинки(СсылкаФайл.Расширение));
 	Структура.Вставить("Картинка"		, СсылкаФайл);

	Возврат Структура;
КонецФункции

//Получаем Base64Данные
//
&НаСервере
Функция Base64ДанныеСервер(Картинка)	
	Возврат Картинка.Base64Данные;
КонецФункции

//Оповещение команды Сохранить
//
&НаКлиенте
// Описание: обработчик после выбора каталога для сохранения - записывает файл из двоичных данных в выбранную папку и выводит уведомление/ошибку.
Процедура ПослеВыбораКаталогаСохраненияФайла(КаталогВыбор, Диалог) Экспорт
    
    Если КаталогВыбор = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    Если КаталогВыбор.Количество()=0 Тогда
        Возврат;
    КонецЕсли;
    
    ИмяФайла = КаталогВыбор[0];
    
   	Сведения =  ПолучитьСведенияОФайле(Элементы.Состав.ТекущиеДанные.Картинка);
    Если ЗначениеЗаполнено(Сведения.Наименование) И ЗначениеЗаполнено(Сведения.Расширение) Тогда
    	ИмяФайла = Диалог.Каталог + Сведения.Наименование + Сведения.Расширение;
    КонецЕсли;
    	
    ДвДанные= СсылкаНаДвоичныеДанныеФайла(Элементы.Состав.ТекущиеДанные.Картинка);
    
    Попытка
        ДвДанные.Записать(ИмяФайла);
        ПоказатьПредупреждение(,"Файл записан!");
    Исключение
        ПоказатьПредупреждение(,"Ошибка: " + ОписаниеОшибки() + ", записи файла. Файл не записан!");    
    КонецПопытки;
    
КонецПроцедуры

//Получаем ДвоичныеДанные
//
&НаСервере
Функция СсылкаНаДвоичныеДанныеФайла(Картинка)
	  
  Возврат Картинка.ФайлХранилище.Получить();
 
КонецФункции

//Получаем сведения о файле
//
&НаСервере
Функция ПолучитьСведенияОФайле(Картинка)
	
	Структура = Новый Структура();
	Структура.Вставить("Наименование",	Картинка.Наименование);
	Структура.Вставить("Расширение",	Картинка.Расширение);
	
	Возврат Структура;

КонецФункции

#КонецОбласти

#Область Изменить
 
 &НаКлиенте
 // Описание: подготавливает HTML-значение строки для предпросмотра/редактирования (для картинки - маркер, для текста - нормализация переносов).
 Процедура ИзменитьТекстСтрокиHTML(ТекстВставки, ЭтоКартинка)
	 	 
	 Если ЭтоКартинка Тогда
	 	ТекстСтроки 		= "Картинка"; 	
	 Иначе
	 	ТекстСтроки 		= СтрЗаменить(ТекстВставки,"<br>", Символы.ПС);
		ТекстВставки 		= СтрЗаменить(ТекстВставки, Символы.ПС, "<br>");
	 КонецЕсли;
	  	 
	 ТекстСтрокиHTML 	= ВставкаДляСтрокиТекста(ТекстВставки);    
	 
	 Если НЕ ЭтоКартинка Тогда	 
	 	ТекстСтроки 	= СтрЗаменить(ТекстВставки,"<br>", Символы.ПС); //Испр странный глюк
	 КонецЕсли;
	 
 КонецПроцедуры
  
// Изменить выделенное.
// Модифицирует выделенный текст по условия из структуры  
//  
&НаКлиенте
// Описание: модифицирует выделенный текст в поле редактора по правилам структуры (обертывание одиночным/парным тегом или вставка ссылки/символа).
Процедура ИзменитьВыделенное(Структура)
	
	ВыделенныйТекстДо = Элементы.ТекстСтрокиРасширеннаяПодсказка.Родитель.ВыделенныйТекст;

	Если Не ВыделенныйТекстДо = "" Тогда //Если ВыделенныйТекст заполнен 
		Структура.Вставить("ВыделенныйТекстДо", ВыделенныйТекстДо);
		Если Структура.Одиночный Тогда
			ВыделенныйТекст = ТекстДляВставкиОдиночногоСимвола(Структура);	
		Иначе
			ВыделенныйТекст = ТекстДляВставкиДвойногоСимвола(Структура);
		КонецЕсли;

		Элементы.ТекстСтрокиРасширеннаяПодсказка.Родитель.ВыделенныйТекст = "";
		Элементы.ТекстСтрокиРасширеннаяПодсказка.Родитель.ВыделенныйТекст = ВыделенныйТекст;

	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Функция ТекстДляВставкиСпецсимвола(Структура)
	Если Структура.МестоВставки = "Перед" Тогда
		ВыделенныйТекст = Структура.Символ + Структура.ВыделенныйТекстДо;
	Иначе
		ВыделенныйТекст = Структура.ВыделенныйТекстДо + Структура.Символ;
	КонецЕсли;

	Возврат ВыделенныйТекст;
КонецФункции

&НаКлиенте
Функция ТекстДляВставкиОдиночногоСимвола(Структура)
	Если Структура.Спесимвол Тогда
		ВыделенныйТекст = ТекстДляВставкиСпецсимвола(Структура);
	Иначе
		ВыделенныйТекст = "<" + Структура.Символ + ">" + Структура.ВыделенныйТекстДо;
	КонецЕсли;
	Возврат ВыделенныйТекст;
КонецФункции

Функция ТекстДляВставкиДвойногоСимвола(Структура)
	Если Структура.Символ = "href" Тогда
		ВыделенныйТекст = "<a href=" + Структура.Адрес + ">" + Структура.Описание + "</a>";
	ИначеЕсли Структура.Заголовок Тогда
		ВыделенныйТекст = Структура.ВыделенныйТекстДо;
	Иначе
		ВыделенныйТекст = "<" + Структура.Символ + ">" + Структура.ВыделенныйТекстДо + "</" + Структура.Символ + ">";
	КонецЕсли;
	
	Возврат ВыделенныйТекст;
КонецФункции
	
#КонецОбласти

#Область НачальнаяСтраница
// Добавить начальную страницу HTML.
//Формируют пустую струткура Основного текста - HTML документа
//
&НаСервере
// Описание: добавляет в состав начальную заготовку HTML-документа (doctype/html/head/body).
Процедура ДобавитьНачальнуюСтраницуHTML()
 	Структура = Новый Структура;
 	
 	Структура.Вставить("Вставка", Ложь); 
 	Структура.Вставить("НомерСтроки"	, 0);
  	Структура.Вставить("Тэг"			, Неопределено);
	
 	Структура.Вставить("ТекстДобавления", "<!DOCTYPE html>");
 	ДобавитьСтрокуHTML(Структура); 
 	
 	Структура.Вставить("ТекстДобавления", "<html lang=""ru"">");
 	ДобавитьСтрокуHTML(Структура); 
 	
 	ТекстДобавления = ДобавитьHead();
 		
 	Структура.Вставить("ТекстДобавления", ТекстДобавления);
 	ДобавитьСтрокуHTML(Структура); 
 	
 	Структура.Вставить("ТекстДобавления", "<body>");
 	ДобавитьСтрокуHTML(Структура); 
 	
 	Структура.Вставить("ТекстДобавления", "</body>");
 	ДобавитьСтрокуHTML(Структура); 
 	
 	Структура.Вставить("ТекстДобавления", "</html>");
 	ДобавитьСтрокуHTML(Структура); 
 
КонецПроцедуры
 
// Добавить head.
//Добавляет секцию head
// 
&НаСервере
Функция ДобавитьHead()
 	ТекстКоментария = "";
 	ТекстКоментария = ТекстКоментария + "<head>";
 	ТекстКоментария = ТекстКоментария + Символы.ПС + "	<meta charset=""UTF-8""" + ">";
 	ТекстКоментария = ТекстКоментария + Символы.ПС + "	<title>" + Объект.Наименование + "</title>";
 	ТекстКоментария = ТекстКоментария + Символы.ПС + "</head>";
 	
 	Возврат ТекстКоментария; 
КонецФункции
#КонецОбласти 
 
#Область ТекстДляВставки
//Добавляем данные текста в структуру
//
&НаСервере
Функция СформироватьСтруктуруДляВставки(ВыбранноеЗначение)
	НомерСтроки = ПолучитьНомерСтрокиДляВставки();
	
	Структура = Новый Структура();	
 	Структура.Вставить("ТекстДобавления", ВыбранноеЗначение.ВведенныйТекст);
 	Структура.Вставить("НомерСтроки"	, НомерСтроки-1);
 	Структура.Вставить("Вставка"		, Истина);
 	Структура.Вставить("Тэг"			, ВыбранноеЗначение.Тэг);

	Возврат Структура;
КонецФункции

#КонецОбласти

&НаКлиенте
// Описание: формирует HTML списка (ul/ol) по данным формы ввода списка и добавляет его строкой в состав.
Процедура ПослеФормыВводаСписка(Параметр, ДопПараметры) Экспорт
	Структура = Новый Структура();
	
	Если Параметр.Вид = ПредопределенноеЗначение("Перечисление.ВидыСписковHTML.Маркированный") Тогда
		Структура.Вставить("Тэг" , ПредопределенноеЗначение("Справочник.Тэги.ul"));
	ИначеЕсли  Параметр.Вид = ПредопределенноеЗначение("Перечисление.ВидыСписковHTML.Нумерованный") Тогда 	
		Структура.Вставить("Тэг" , ПредопределенноеЗначение("Справочник.Тэги.ol"));
	Иначе	
	
	КонецЕсли;
	
	Структура.Вставить("Строки"		, Параметр.Строки);
	
	ДобавитьСписокHTML(Структура); 
	
КонецПроцедуры

&НаКлиенте
// Описание: обработчик после ввода таблицы HTML (в текущей реализации не выполняет дополнительных действий).
Процедура ПослеФормаВводаТаблицы(Параметр, ДопПараметры) Экспорт
	Структура = Новый Структура();
КонецПроцедуры	

&НаКлиенте
// Описание: управляет видимостью групп элементов формы по флагам из структуры (например, редактируется ли текст и есть ли новый текст).
Процедура УстановитьВидимость(Структура)
 
	Элементы.ГруппаРедактирования.Видимость 	= Структура.Редактируется;
	Элементы.Состав.Видимость 					= Не Структура.НовыйТекст;	
	Элементы.ГруппаОсновнойТекст.Видимость 		= Не Структура.Редактируется;
	Элементы.ПредпросмотрHTML.Видимость  		= Структура.Редактируется;
	Элементы.ГруппаПоля.Видимость 				= Структура.Редактируется;
	
	текстСтроки 	= "";
	ТекстСтрокиHTML = Неопределено;
	
КонецПроцедуры

&НаКлиенте
// Описание: применяет выбранную ссылку (формирует структуру href и изменяет выделенное в редакторе).
Процедура ПослеВыбораСсылки(Параметр, ДопПараметры) Экспорт
	
	ВыделенныйТекст  = Элементы.ТекстСтроки.ВыделенныйТекст;
	
	Если ЗначениеЗаполнено(ВыделенныйТекст) Тогда
		Структура = Новый Структура;
		Структура.Вставить("Символ"			, "href");
		Структура.Вставить("Одиночный"		, Ложь);
		Структура.Вставить("Спесимвол"		, Ложь);
		Структура.Вставить("МестоВставки"	, Ложь);
		Структура.Вставить("Адрес"			, Параметр.Адрес);
		Структура.Вставить("Описание"		, Параметр.Описание);
		Структура.Вставить("Заголовок"		, Ложь);
		
		ИзменитьВыделенное(Структура);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Описание: добавляет описание в Объект.Примечания и вставляет якорную ссылку '(о)' в текущее место в HTML строки.
Процедура ПослеВыбораОписания(Параметр, ДопПараметры) Экспорт
	Если ЗначениеЗаполнено(Параметр.Описание) Тогда
		ID = "Описание_" + Элементы.Состав.ТекущаяСтрока;
		НомерОписания = НайтиНомерОписания(ID);
		Если НомерОписания = Неопределено Тогда
			ID = ID + "1";
		Иначе
			ID = "Описание_" + (Число(Сред(НомерОписания, 10)) + 1);
		КонецЕсли;
		НоваяСтрока = Объект.Примечания.Добавить();
		НоваяСтрока.id 			= ID;
		НоваяСтрока.Вид 		= ПредопределенноеЗначение("Перечисление.ВидыПримечаний.Описание");
		НоваяСтрока.Текстовка 	= Параметр.Описание;
		
		ТекстСтроки = Лев(Элементы.Состав.ТекущиеДанные.Значение, ДопПараметры.НомерВставки-1) 
			+ "<a href='#" + ID +"'> (о) </a>" 
			+ Сред(Элементы.Состав.ТекущиеДанные.Значение,  ДопПараметры.НомерВставки - 1, СтрДлина(ДопПараметры.Выделенныйтекст)); 
		
		Модифицированность = Истина;
		
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Функция НайтиНомерОписания(ID)
	
	НомерОписания = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаметкиПримечания.id
		|ИЗ
		|	Справочник.Заметки.Примечания КАК ЗаметкиПримечания
		|ГДЕ
		|	ЗаметкиПримечания.Вид = &Вид
		|	И ЗаметкиПримечания.Ссылка = &Ссылка
		|	И ЗаметкиПримечания.id Подобно &id";
	
	Запрос.УстановитьПараметр("id"		, "%"+id+"%");
	Запрос.УстановитьПараметр("Ссылка"	, Объект.Ссылка);
	Запрос.УстановитьПараметр("Вид"		, Перечисления.ВидыПримечаний.Описание);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НомерОписания = ВыборкаДетальныеЗаписи.id;
	КонецЦикла;

	Возврат НомерОписания;
	
КонецФункции

// Добавить строку HTML.
// Новая строка в ТЧ 
//Параметр - Структура
//формируется функцией СформироватьСтруктуруДляВставки 
//или вручную:
//Вставка 			- булево
//НомерСтроки     	- число 
//Тэг 				- спр. Тэги
//Картинка 			- хранилище значений (необязательно)
//ТекстДобавления 	- строка  
//
&НаСервере
// Описание: добавляет/вставляет строку в табличную часть 'Состав' согласно структуре (в т.ч. определяет тег и картинку для img/file), затем синхронизирует данные с формой.
Процедура ДобавитьСтрокуHTML(Структура)
 	Если Структура.Вставка Тогда
 		НоваяСтрока = Объект.Состав.Вставить(Структура.НомерСтроки);
 	Иначе	
 		НоваяСтрока = Объект.Состав.Добавить();	
 	КонецЕсли;
 	
 	Если ЗначениеЗаполнено(Структура.Тэг) Тогда
		Если Структура.Тэг.Наименование = "img" Или Структура.Тэг.Наименование = "file" Тогда
			Если Структура.Свойство("Картинка") Тогда
				НоваяСтрока.Картинка = Структура.Картинка;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
 			
 	НоваяСтрока.Значение = Структура.ТекстДобавления; 
	Если Не Структура.Тэг = Неопределено Тогда  
 		НоваяСтрока.Тэг      = Структура.Тэг;
	КонецЕсли;
	
	СоставВТаблицу();
 КонецПроцедуры
 
 &НаСервере
// Описание: формирует HTML списка (ul/ol) из массива строк и добавляет его в 'Состав', обновляя основной HTML документа.
Процедура ДобавитьСписокHTML(Структура)
	
	Если Структура.Строки.Количество() > 0 Тогда
		НомерТекущейСтроки 	= ПолучитьНомерСтрокиДляВставки();
		НоваяСтрока 		= Объект.Состав.Вставить(НомерТекущейСтроки-1);

		Если Структура.Тэг = ПредопределенноеЗначение("Справочник.Тэги.ul") Тогда
			ТексДляВставки = "<ul>";
		ИначеЕсли Структура.Тэг = ПредопределенноеЗначение("Справочник.Тэги.ol") Тогда
			ТексДляВставки = "<ol>";
		КонецЕсли;

		Для Каждого СтрокаМассива Из Структура.Строки Цикл
			ТексДляВставки =  ТексДляВставки + " <li>" + СтрокаМассива + "</li>";
		КонецЦикла;

		Если Структура.Тэг = ПредопределенноеЗначение("Справочник.Тэги.ul") Тогда
			ТексДляВставки = ТексДляВставки + "</ul>";
		ИначеЕсли Структура.Тэг = ПредопределенноеЗначение("Справочник.Тэги.ol") Тогда
			ТексДляВставки = ТексДляВставки + "</ol>";
		КонецЕсли;

		НоваяСтрока.Значение = ТексДляВставки;
		
		Модифицированность = Истина;
		
		Объект.ОсновнойТекст = СформироватьОсновнойТекст();
		 
	КонецЕсли;
	
КонецПроцедуры
	
// Сформировать основной текст.
// Формирует страницу html
//
&НаСервере
Функция СформироватьОсновнойТекст()
	
	ОсновнойТекст 	= "";	
	ТабИзмСтрок 	= УдалитьСоставВТаблицу();	 
	ОсновнойТекст 	= ОсновнойТекстHTMLСервер.ПолучитьОсновнойТекстИзТаблицы(ТабИзмСтрок);
		
	Возврат ОсновнойТекст;
	
КонецФункции

// Вставки для строки текста.
// Формирует мини страницу html для строки ТЧ
// 
&НаСервере
Функция ВставкаДляСтрокиТекста(ТекстВставки)
	ТекстДляВставки = "";
	
	ТекстДляВставки = "<!DOCTYPE html>"
	+ "<html lang=""ru"">"
	+ "<head>" 
	+ "	<meta charset=""UTF-8""" + ">"
	+ "	<title> </title>"
	+ "</head>"
	+"<body>"
	+ ТекстВставки
	+ "</body>" 
	+ "</html>"
	;
	
	Возврат ТекстДляВставки
	
КонецФункции 	

 //Формирует значения/условия данных для изменения  
 //
 &НаКлиенте
 Функция СформироватьСтруктуруФорматированияТекста()
 	Структура = Новый Структура();
 	Структура.Вставить("Одиночный"		, Ложь);
 	Структура.Вставить("Спесимвол"		, Ложь);
 	Структура.Вставить("МестоВставки"	, Ложь);
 	Структура.Вставить("Заголовок"		, Ложь);
 	
 	Возврат Структура;
 КонецФункции
 
//Возвращаем значение
//	 
&НаСервере
 Функция ОдиночныйТэг(Тэг)
  	
  	Возврат Тэг.Одиночный;
  	
 КонецФункции
  
// Получить номер строки для вставки.
// Ищет номер строки перед закрытие секции body
//
&НаСервере
Функция ПолучитьНомерСтрокиДляВставки()
	
	Отбор = Новый Структура();
	Отбор.Вставить("Значение", "</body>");
	 
	ПоискБоди = Объект.Состав.НайтиСтроки(Отбор);
	//ПоискБоди = мТаблицаСостав.НайтиСтроки(Отбор);
	Если ПоискБоди = Неопределено Тогда
		НомерСтроки = ПолучитьКоличествоСтрокПолей();
	Иначе
		НомерСтроки = ПоискБоди[0].НомерСтроки	
	КонецЕсли;			
	
	Возврат НомерСтроки;
	
КонецФункции

// Получить количество строк ТЧ Состав.
// 
&НаСервере
Функция ПолучитьКоличествоСтрокПолей()
	Возврат Объект.Состав.Количество();
КонецФункции

//Заполняем Лекцию из Темы
//
&НаСервере
// Описание: серверный обработчик изменения темы (в текущем модуле закомментированная логика).
Процедура ТемаПриИзмененииНаСервере()
	//Объект.Лекция = Объект.Тема.Лекция;
КонецПроцедуры

&НаСервере
Функция ПолучитьОписаниеИзСтроки(СтрокаОписания)
	
	Описание = "";
	ПоискИД = СтрНайти(СтрокаОписания, "#");
	Если ПоискИД > 0 Тогда                        
		ИД = Сред(СтрокаОписания, ПоискИД + 1); 
		Отбор = Новый Структура;
		Отбор.Вставить("id", ИД);
		МассивОтбора = Объект.Примечания.НайтиСтроки(Отбор);
		Если МассивОтбора.Количество()> 0 Тогда  
			 СтрокаОтбора 	= МассивОтбора.Получить(0);
			 Описание 		= СтрокаОтбора.Текстовка;
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Описание;  
	
КонецФункции

&НаСервере
// Описание: добавляет строку в табличное значение формы (мТаблицаСостав) и синхронизирует ее с Объект.Состав.
Процедура ДобавитьСтрокуТаблицы(Структура)

	Если Редактировать Тогда
		НоваяСтрока = мТаблицаСостав.Получить(Структура.НомерСтроки-1); 
	Иначе
		НомерСтроки = ПолучитьНомерСтрокиДляВставки()-1; //получаем номер, - 1 индекс
		НоваяСтрока = мТаблицаСостав.Вставить(НомерСтроки);
	КонецЕсли;

	НоваяСтрока.Значение 	= ТекстСтроки;
	Если ЗначениеЗаполнено(ЭтоЗаголовок) Тогда
		НоваяСтрока.Тэг = ЭтоЗаголовок;
	ИначеЕсли Не ЗначениеЗаполнено(НоваяСтрока.Тэг) Тогда 	
		НоваяСтрока.Тэг = ПредопределенноеЗначение("Справочник.Тэги.p")	
	КонецЕсли;	

	ТаблицуВСостав(мТаблицаСостав);
	
КонецПроцедуры

&НаСервере
Функция УдалитьСоставВТаблицу()
	Возврат Объект.Состав.Выгрузить();
КонецФункции

&НаСервере
// Описание: выгружает Объект.Состав в реквизит формы 'мТаблицаСостав' для дальнейшего редактирования на клиенте.
Процедура СоставВТаблицу()
	
	Табл = РеквизитФормыВЗначение("мТаблицаСостав");
	Табл = Объект.Состав.Выгрузить();
	ЗначениеВРеквизитФормы(Табл, "мТаблицаСостав");
	
КонецПроцедуры

&НаСервере
// Описание: загружает содержимое реквизита формы 'мТаблицаСостав' обратно в Объект.Состав.
Процедура ТаблицуВСостав(Таблица)
	Табл = РеквизитФормыВЗначение("мТаблицаСостав");
	Объект.Состав.Загрузить(Табл);
КонецПроцедуры 
		
#КонецОбласти
